# Задача 12: Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница. Петя помогает Кате по математике.
# Он задумывает два натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать.
# Для этого Петя делает две подсказки. Он называет сумму этих чисел S и их произведение P.
#  Помогите Кате отгадать задуманные Петей числа..


sum_num = int(input("Введите сумму чисел: "))
multiply_num = int(input("Введите произведение чисел: "))
for x in range(sum_num):
    for y in range(sum_num):
        if x + y == sum_num and x * y == multiply_num:
            print(x, y)
